CREATE TABLE consume (
    memId INT,                      -- 用户ID，外键，关联到 Member 表
    id INT AUTO_INCREMENT,          -- 消费ID，自增，主键
    amount INT NOT NULL,            -- 消费金额
    transactionType BOOLEAN NOT NULL,  -- 消费类型，0支出，1收入
    consumeDate DATE NOT NULL,         -- 消费时间
    recipient VARCHAR(255),         -- 流向，金额消费给谁或如何得到收入
    category VARCHAR(100),          -- 消费类别，具体的消费类别
    isDeleted BOOLEAN DEFAULT 0,    -- 删除标记，是否删除标记，默认为 0（未删除）
    userNote VARCHAR(255),          -- 用户备注
    PRIMARY KEY (id),
    FOREIGN KEY (memId) REFERENCES Member(memId) -- 关联到 Member 表的 memId
);

INSERT INTO financial.consume (memId, amount, transactionType, consumeDate, recipient, category, isDeleted, userNote) VALUES
	 (1,50000,1,'2024-08-01','建设银行','奖金',0,'月度绩效奖'),
	 (1,120000,0,'2024-08-02','中国银行','购物',0,'购买家电'),
	 (1,80000,1,'2024-08-03','农业银行','兼职收入',0,'兼职项目完成'),
	 (1,95000,0,'2024-08-04','招商银行','医疗',1,'年度体检费用'),
	 (1,45000,1,'2024-08-05','交通银行','理财收益',0,'基金收益到账'),
	 (1,30000,0,'2024-08-06','民生银行','餐饮',0,'请客吃饭'),
	 (1,20000,0,'2024-08-07','光大银行','娱乐',1,'看电影'),
	 (1,70000,1,'2024-08-08','兴业银行','投资回报',0,'股票分红'),
	 (1,60000,0,'2024-08-09','浦发银行','教育',0,'孩子学费'),
	 (1,35000,0,'2024-08-10','中信银行','交通',0,'购买火车票'),
	 (1,40000,0,'2024-08-11','邮储银行','饮品',1,'咖啡消费'),
	 (1,75000,1,'2024-08-12','华夏银行','奖金',0,'季度绩效奖'),
	 (1,65000,0,'2024-08-13','广发银行','购物',0,'购买家居用品'),
	 (1,55000,0,'2024-08-14','平安银行','娱乐',1,'游戏充值'),
	 (1,80000,1,'2024-08-15','渤海银行','兼职收入',0,'翻译项目完成'),
	 (1,72000,0,'2024-08-16','恒丰银行','餐饮',0,'家庭聚餐'),
	 (1,64000,0,'2024-08-17','浙商银行','交通',0,'加油费'),
	 (2,130000,1,'2024-08-18','深圳银行','工资',0,'月工资到账'),
	 (2,47000,0,'2024-08-19','上海银行','教育',0,'培训费'),
	 (2,57000,0,'2024-08-20','北京银行','医疗',1,'药品购买'),
	 (2,45000,0,'2024-08-21','南京银行','饮品',0,'奶茶消费'),
	 (2,68000,1,'2024-08-22','东亚银行','奖金',0,'年度奖金'),
	 (2,61000,0,'2024-08-23','青岛银行','购物',1,'购买电子产品'),
	 (2,55000,1,'2024-08-24','华夏银行','理财收益',0,'债券收益'),
	 (2,33000,0,'2024-08-25','天津银行','娱乐',0,'KTV消费'),
	 (2,49000,0,'2024-08-26','成都银行','交通',1,'出租车费用'),
	 (1,72000,1,'2024-08-27','昆仑银行','兼职收入',0,'开发项目收入'),
	 (2,80000,0,'2024-08-28','兰州银行','餐饮',0,'公司聚餐'),
	 (1,100000,0,'2024-08-29','工商银行','购物',0,'购买奢侈品');
